# Той е зает през работните дни и играе волейбол само през уикендите и в празничните дни.
# Влади играе в София всяка събота, когато не е на работа и не си пътува до родния град, както и в 2/3 от празничните дни.
# #Той пътува до родния си град h пъти в годината, където играе волейбол със старите си приятели в неделя. Влади не е на работа 3/4 от уикендите, в които е в София. Отделно, през високосните години Влади играе с 15% повече волейбол от нормалното. Приемаме, че годината има точно 48 уикенда, подходящи за волейбол.
# Напишете програма, която изчислява колко пъти Влади е играл волейбол през годината. Закръглете резултата надолу до най-близкото цяло число (например 2.15  2; 9.95  9).
import math
year = input() #"leap" (високосна година) или "normal" (невисокосна)
p = int(input()) # брой празници в годината (които не са събота и неделя)
h = int(input()) # брой уикенди, в които Влади си пътува до родния град
total_weekends = 48
weekends_sofia = total_weekends - h
play_weekends_sofia = weekends_sofia * (3/4)
play_holiday = p * (2/3)
total_play = play_weekends_sofia + h + play_holiday
if year == "leap":
    total_play *= 1.15
    print(math.floor(total_play))
elif year == "normal":
    print(math.floor(total_play))
