# Да се напише програма, която прочита едно цяло число N и генерира всички възможни
# "щастливи" и различни 4-цифрени числа(всяка цифра от числото е в интервала [1...9]).

# Числото трябва да отговаря на следните условия:
# Щастливо число е 4-цифрено число, на което сбора от първите две цифри е равен на сбора от последните две.
# Числото N трябва да се дели без остатък от сбора на първите две цифри на "щастливото" число.
# f"{i}{j}{k}{l}" % (i+j) == 0 and

N = int(input())

for i in range(1, 10):
    for j in range(1, 10):
        for k in range(1, 10):
            for l in range(1, 10):
                sum1 = i + j
                sum2 = k + l
                if (sum1) == (sum2):
                    if N % (sum1) == 0:
                        print(f"{i}{j}{k}{l}", end = " ")
