# Имаме банкноти и монети по 1лв., по 2лв. и по 5лв.
# Да се напише програма, която прочита въведените от потребителя брой банкноти и монети и сума,
# и извежда на екран всички възможни начини по които сумата може да се изплати с наличните банкноти.

# Да се отпечатат на конзолата всички комбинации от дадените номинали, образуващи сумата, форматирани по следния начин:
# o	"{бр. 1лв.} * 1 lv. + {бр. 2лв.} * 2 lv. + {бр. 5лв.} * 5 lv. = {сума} lv."

coins_1 = int(input())# 1.	Брой монети по 1лв. - цяло положително число;
coins_2 = int(input())# 2.	Брой монети по 2лв. - цяло положително число;
notes_5 = int(input())# 3.	Брой банкноти по 5лв. - цяло положително число;
amount = int(input())# 4.	Сума - цяло положително число в интервала [1…1000];

for i in range(0, coins_1 + 1):
    for j in range(0, coins_2 + 1):
        for k in range(0, notes_5 + 1):
            if i + j * 2 + k * 5 == amount:
                print(f"{i} * 1 lv. + {j} * 2 lv. + {k} * 5 lv. = {amount} lv.")
                continue