# Прапраправнукът на Сали Яшар е получил наследство - сейф с парола - четири цифри. В него е заключена тайната на пеещите каруци.
# Той има автосервиз и се нуждае от реклама, затова е решил да направи такава каруца.
# Проблемът е, че паролата е скрита в следната задача:

# „Парола ще получиш, ако знаеш  едно цяло число,
# контролна стойност  се нарича то,
# почива в интервала от 4 до 144 включително,
# но да го откриеш може би ще е мъчително. ”

# Паролата има формат: "abcd" и контролната стойност трябва да е равна на  a*b + c*d , но трябва да бъдат спазени следните условия:
# •	при намирането на а и b: a < b
# •	при намиране на  c и d: c > d .
# Каруцата  има четири колела, затова паролата ще е четвърто число, което трябва да се отпечата.
# В случай, че НЕ се намери такова число,  отпечатва се „No!“.
# Вход
# От конзолата се чете едно цяло число (контролната стойност): M – цяло число в интервала [4 … 144];
# Изход
# Отпечатването на конзолата зависи от резултата:
# •	Ако са намерени четворки числа (аbcd), отговарящи на условието, ги отпечатваме всичките с разделител интервал: “{а}{b}{c}{d} ”
# •	Отпечатва се един от двата реда на нов ред:
# •	Ако съществува четвърта четворка се отпечатва: „Password: {а}{b}{c}{d}“
# •	Ако НЕ са намерени такива числа или няма  четвърта четворка отпечатваме: “No!”
m = int(input())
count = 0
output = ''
is_found = False
a = 0
b = 0
c = 0
d = 0

for i in range(1, 10):
    for j in range(i + 1, 10):
        for k in range(1, 10):
            for l in range(1, 10):
                if k > l and i * j + k * l == m:
                    count += 1
                    print(f"{i}{j}{k}{l}", end=' ')
                    if count == 4:
                        is_found = True
                        a = i
                        b = j
                        c = k
                        d = l
print()
if is_found:
    print(f"Password: {a}{b}{c}{d}")
else:
    print("No!")