# Младоженците искат да направят списък кой на кое място ще седи на сватбената церемония.
# Местата са разделени на различни сектори.
# Секторите са главните латински букви като започват от A.
# Във всеки сектор има определен брой редове.
# От конзолата се чете броят на редовете в първия сектор (A),
# като във всеки следващ сектор редовете се увеличават с 1.
# На всеки ред има определен брой места - тяхната номерация е представена с малките латински букви.
# Броя на местата на нечетните редове се прочита от конзолата, а на четните редове местата са с 2 повече.
# От конзолата се четaт 3 реда:
# •	Последния сектор от секторите - символ (B-Z)
# •	Броят на редовете в първия сектор - цяло число (1-100)
# •	Броят на местата на нечетен ред - цяло число (1-24)
# {сектор}{ред}{място} # Да се отпечата на конзолата всяко място на отделен ред по следния формат:
# Накрая трябва да отпечата броя на всички места.
sector = input()
row_seats = int(input())
seats_count = int(input())
combo = 0
for sector in range(65, ord(sector)+1):
    row_seats += 1
    for rows in range(1, row_seats):
        if rows % 2 == 0:
            for seats in range(97, (97 + seats_count) + 2):
                print(f"{chr(sector)}{rows}{chr(seats)}")
                combo += 1
        else:
            for seats in range(97, (97 + seats_count)):
                print(f"{chr(sector)}{rows}{chr(seats)}")
                combo += 1
print(combo)