# Напишете програма която проверява всички възможни комбинации от двойка числа в интервала от две дадени числа.
# На изхода се отпечатва, коя поред е комбинацията чиито сбор от числата е равен на дадено магическо число.
# Ако няма нито една комбинация отговаряща на условието се печата съобщение, че не е намерено.

# На конзолата трябва да се отпечата един ред, според резултата:
# •	Ако е намерена комбинация чиито сбор на числата е равен на магическото число
# o	"Combination N:{пореден номер} ({първото число} + {второ число} = {магическото число})"
# •	Ако не е намерена комбинация отговаряща на условието
# o	"{броят на всички комбинации} combinations - neither equals {магическото число}"

n1 = int(input())  # Първи ред – начало на интервала – цяло число
n2 = int(input())  # Втори ред – край на интервала – цяло число
magic_n = int(input())  # Трети ред – магическото число – цяло число
sum = 0
count = 0
combo_count = 0
combo_n1 = 0
combo_n2 = 0
combo = False
for i in range(n1, n2 + 1):
    if combo:
        break
    for j in range(n1, n2 + 1):
        sum = i + j
        count += 1
        if sum == magic_n:
            combo_n1 = i
            combo_n2 = j
            combo_count += count
            combo = True
            break
if combo:
    print(f"Combination N:{combo_count} ({combo_n1} + {combo_n2} = {magic_n})")
else:
    print(f"{count} combinations - neither equals {magic_n}")

