# Да се напише програма, която генерира серия от символи като в шаблона:
# ABxyBA
# като при всяко генериране на нов код, стойностите на символите се увеличават с 1.
# Ако A надхвърли 55, се връща на 35.
# Ако B надхвърли 96, се връща на 64.
# Ограничения:
# •	A е символ с ASCII стойност в диапазона [35… 55]
# •	B е символ с ASCII стойност в диапазона [64 … 96]
# •	x e цяло число в диапазона [1… a]
# •	y e цяло число в диапазона [1… b]
# Да се отпечата на конзолата:
# •	Генерираният код. Ако броят на комбинациите е по-голям от максималния на кода, да се отпечата до подадената стойност, в противен случай да се отпечата до текущия брой на комбинациите.

a = int(input())
b = int(input())
max_pass_count = int(input())
count = 0
stop = False
for i in range(35, 55):
    if stop:
        break
    for j in range(64, 96):
        if stop:
            break
        for k in range(1, a+1):
            if stop:
                break
            for l in range(1, b+1):
                print(f"{chr(i)}{chr(j)}{k}{l}{chr(j)}{chr(i)}", end = "|")
                i += 1
                j += 1
                count += 1
                if count == max_pass_count or (k == a and l == b):
                    stop = True
                    break
                if i > 55:
                    i = 35
                if j > 96:
                    j = 64

