# Напишете програма, която да изчислява, колко ще струва на един шофьор да напълни резервоара на автомобила си, като знаете – какъв тип гориво зарежда, каква е цената за литър гориво и дали разполага с карта за отстъпки. Цените на горивата са както следва:
# •	Бензин – 2.22 лева за един литър,
# •	Дизел – 2.33 лева за един литър
# •	Газ – 0.93 лева за литър
# Ако водача има карта за отстъпки,  той се възползва от следните намаления за литър гориво: 18 ст. за литър бензин, 12 ст. за литър дизел и 8 ст. за литър газ.
# Ако шофьора е заредил между 20 и 25 литра включително, той получава 8 процента отстъпка от крайната цена, при повече от 25 литра гориво, той получава 10 процента отстъпка от крайната цена.
# Изход
# На конзолата трябва да се отпечата един ред.
# •	"{крайната цена на горивото} lv."
# Цената на горивото да бъде форматираната до втората цифра след десетичния знак.



fuel_type = input()
fuel_amount = float(input())
club_card = input()
fuel_price = 0
if fuel_type == "Diesel":
    if club_card == "Yes":
        fuel_price = fuel_amount * (2.33 - 0.12)
    elif club_card == "No":
        fuel_price = fuel_amount * 2.33
elif fuel_type == "Gasoline":
    if club_card == "Yes":
        fuel_price = fuel_amount * (2.22 - 0.18)
    elif club_card == "No":
        fuel_price = fuel_amount * 2.22
elif fuel_type == "Gas":
    if club_card == "Yes":
        fuel_price = fuel_amount * (0.93 - 0.08)
    elif club_card == "No":
        fuel_price = fuel_amount * 0.93
if 20 <= fuel_amount <= 25:
    fuel_price *= 0.92
elif fuel_amount > 25:
    fuel_price *= 0.9
print(f"{fuel_price:.2f} lv.")
