######################################################################################################################
################ МОЕ РЕШЕНИЕ БЕЗ РЕГЕКС###############################################################################

#
# string_list = input().split()
# matches = []
# for el in string_list:
#     if el[0] == "_" and el[-1] != "_" and el[1] != "_":
#         matches.append(el)
# matches_final = [x[1::] for x in matches]
# print(",".join(matches_final))

######################################################################################################################
################ Решение ИНЕС ########################################################################################


import re

pattern = r"((?<=^_)|(?<=\s_))[A-Za-z0-9]+\b"

data = input()

matches = [el.group() for el in re.finditer(pattern, data)]

print(*matches, sep=",")



































