# Да се напише програма, която чете две цели числа n и l, въведени от потребителя,
# и генерира по азбучен ред всички възможни  пароли, които се състоят от следните 5 символа:
# •	Символ 1: цифра от 1 до n;
# •	Символ 2: цифра от 1 до n;
# •	Символ 3: малка буква измежду първите l букви на латинската азбука;
# •	Символ 4: малка буква измежду първите l букви на латинската азбука;
# •	Символ 5: цифра от 1 до n, по-голяма от първите 2 цифри.
# Вход
# Входът се чете от конзолата и се състои от две цели числа n и l, по едно на ред.
n = int(input())
l = int(input())

for i in range(1, n + 1):
    for j in range(1, n + 1):
        for k in range(97, 97 + l):
            for g in range(97, 97 + l):
                for m in range(1, n + 1):
                    if m > i and m > j:
                        print(f"{i}{j}{chr(k)}{chr(g)}{m}", end = " ")
