# Напишете програма, която генерира комбинации спрямо въведени числа – предположения от потребителя.
# От конзолата се въвеждат три цифри.
# Тези цифри ще бъдат горната граница, до която ние искаме да получим всички трицифрени числа, на които всяка една цифра отговаря на следните условия:
# •	Цифрата на единиците и цифрата на стотиците трябва да бъде четна
# •	Цифрата на десетиците да бъде просто число в диапазона (2...7).
# Това ще са възможните комбинации според въведените предположения от потребителя,
# с които ще може евентуално да се отключи вратата.
# Вход
# От конзолата се четат 3 реда:
# •	Горната граница на стотиците - цяло число в диапазона (1-9)
# •	Горната граница на десетиците - цяло число в диапазона (1-9)
# •	Горната граница на единиците - цяло число в диапазона (1-9)
# Изход
# Да се отпечатат на конзолата всички трицифрени числа, за които всяка една част отговаря на условията по-горе.
n1 = int(input()) #Горната граница на стотиците - цяло число
n2 = int(input()) #Горната граница на десетиците - цяло число
n3 = int(input()) #Горната граница на единиците - цяло число

for i in range(1, n1+1):
    for j in range(1, n2+1):
        for k in range(1, n3+1):
            if (j == 2 or j == 3 or j == 5 or j == 7) and k % 2 == 0 and i % 2 == 0:
                print(f"{i} {j} {k}")