# Ресторант отваря врати и предлага няколко менюта на преференциални цени:
# •	Пилешко меню –  10.35 лв.
# •	Меню с риба – 12.40 лв.
# •	Вегетарианско меню  – 8.15 лв.
# Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
# Групата ще си поръча и десерт, чиято цена е равна на 20 процента от общата сметка (без доставката). Цената на доставка е 2.50лв и се начислява най-накрая.
# Вход
# От конзолата се четат 3 реда:
# •	Брой пилешки менюта – цяло число в интервала [0… 99]
# •	Брой менюта с риба - цяло число в интервала [0… 99]
# •	Брой вегетариански менюта - цяло число в интервала [0… 99]
# Изход
# Да се отпечата на конзолата един ред:  "Total: {цена на поръчката}"
# Сумата да е форматирана до втория знак след десетичната запетая.
chicken = 10.35
fish = 12.40
vege = 8.15
delivery = 2.5
chicken_count = int(input())
fish_count = int(input())
vege_count = int(input())
total = (chicken * chicken_count + fish * fish_count + vege * vege_count)
total_plus_desert = total * 1.2
end_sum = total_plus_desert + delivery
print(f"Total: {end_sum:.2f}")
